{
  "blogs": [
    {
      "id": 2,
      "title": "Purple Hibiscus",
      "author": "Chimamanda Adichie",
      "description": "'Purple Hibiscus' is a story of pain, love, freedom, and family. The novel takes its reader down in history to a young Nigeria plagued by economic instability and political insecurity. The story is told through Kambili's eyes and is essentially about the disintegration of her family unit and her struggle to grow to maturity. A key period is the time Kambili and her brother spend at the house of her father's sister, Ifeoma, and her three children. This household offers a marked contrast to what Kambili and Jaja are used to. It practices a completely different form of Catholicism, making for a happy, liberal place that encourages its members to be inquisitive, form their own opinions and speak their minds. In this nurturing environment, both Kambili and Jaja become more open and more able to form and voice their own opinions. While at Aunty Ifeoma's, Kambili also falls in love with a young priest, Father Amadi, which awakens her sense of her own sexuality. Ultimately, a critical mass is reached in terms of the lives of Kambili, Jaja and the existence of their family as it once was. Unable to cope with Eugene's continual violence any longer, Beatrice poisons him. Jaja takes the blame for the crime and ends up in prison. In the meantime, Aunty Ifeoma and her family move to America after she is unfairly dismissed from her job as lecturer at the University of Nigeria, Nsukka. The novel ends almost three years after these events, on a cautiously optimistic note. Kambili has become a young woman of eighteen, more confident than before, while her brother Jaja is about to be released from prison, hardened but not broken by his experience there. Their mother, Beatrice, has deteriorated psychologically to a great degree.",
      "rate": " 5 stars"
    },
    {
      "id": 3,
      "title": "The Alchemist",
      "author": "Paulo Coelho",
      "description": " The Alchemist tells the story of a young shepherd named Santiago who is able to find a treasure beyond his wildest dreams. Along the way, he learns to listen to his heart and, more importantly, realizes that his dreams, or his Personal Legend, are not just his but part of the Soul of the Universe. Santiago is a humble shepherd whose desires are few–he wants to be free to roam with his sheep, to have some wine in his wineskin and a book in his bag. Fate intervenes, however, in the form of the recurring dream of a great treasure hidden thousands of miles away at the base of the Egyptian Pyramids. When Santiago meets Melchizedek, a strange wise man who claims he is a king from a far-off land, he decides to seek his treasure. The next day, Santiago sells his sheep and embarks to Africa to pursue his dream. Upon arriving in Africa, though, it becomes apparent that things will not be as easy as he thought. The first day Santiago is in Tangiers, he is robbed and left completely alone, unable to speak a single word of Arabic. At first Santiago contemplates giving up and turning around. He remembers the words of the wise man, though, and decides to carry on getting a job at a local crystal shop. After working at the crystal shop for a year, learning much about life and about his Personal Legend, Santiago earns enough money to buy a new flock of sheep and return home. At the last minute, though, Santiago decides to risk it all and join a caravan to Egypt. Once in the caravan, Santiago meets an Englishman who has come all the way to Africa to seek a renowned alchemist. As they travel through the desert, the Englishman tells Santiago about the secrets of alchemy. Santiago finds the Englishman's ideas to be very similar to Melchizedek's. They both speak of a Soul of the World to which we are all connected and of the necessity of following our heart's true desires or our Personal Legend. Santiago, however, prefers to learn these secrets by observing the world, while the Englishman prefers to learn from complex books. While they travel, they begin to hear rumors of a coming tribal war. When they finally arrive at the Al-Fayoum oasis the home of the titular Alchemist–Santiago meets a beautiful girl named Fatima with whom he immediately falls in love. He discovers that love, like the Personal Legend, comes directly from the Soul of the World. While walking in the desert, Santiago has a vision of an upcoming battle. He rushes back to warn the elders at the oasis and, when his vision is confirmed, they offer him a position as a counselor. Santiago considers staying at the oasis with Fatima, but the Alchemist finds Santiago and tells him that he will lead Santiago to his treasure.",
      "rate": "3.9 stars"
    }
  ]
}